{
  "100": {
    "description": " پذیرش و افتتاحیه جشنواره همراه با سخنرانی دکتر بهاد بخشی",
    "id": 100,
    "image": "/images/backgrounds/opening.jpg",
    "language": "فارسی",
    "title": "افتتاحیه جشنواره",
    "startTime": "13:00",
    "endTime": "14:00"
  },
  "101": {
    "complexity": "همه سطوح",
    "description": "1-مقدمه ای بر رایانش ابری و مفاهیم مجازی سازی2\n\n-معرفی راه حل های طراحی و پیاده¬سازی محیط¬های ابری3\n\n-معماری OpenStack4\n\n-بررسی اجزاء \n\nOpenStack5-پیاده¬سازی یک سناریو محیط ابری به وسیله OpenStack ",
    "id": 101,
    "language": "فارسی",
    "speakers": [
      14
    ],
    "tags": [
      "cloud"
    ],
    "title": "کارگاه مجازی سازی"
  },
  "102": {
    "complexity": "پیشرفته",
    "description": "",
    "id": 102,
    "language": "فارسی",
    "speakers": [
      12
    ],
    "tags": [
      "linux"
    ],
    "title": "کارگاه لینوکس پیشرفته"
  },
  "103": {
    "complexity": "مبتدی",
    "description": "01. Introduction to Python\n\n02. Python setup\n\n03. Hello World!\n\n04. General Syntax\n\n05. Objects and data structures\n\n06. Files\n\n07. Comparison operators and chained COs\n\n08. Statements\n\n09. Methods\n\n10. Functions\n\n11. Lambda expressions\n\n12. Some built-in functions\n\n13. Object oriented programming\n\n14. Errors and exceptions\n\n15. Some advanced functions\n\n16. Modules",
    "id": 103,
    "language": "فارسی",
    "speakers": [
      9
    ],
    "tags": [
      "programming"
    ],
    "title": "کارگاه پایتون"
  },
  "104": {
    "complexity": "مبتدی",
    "description": "",
    "id": 104,
    "language": "فارسی",
    "speakers": [
      9
    ],
    "tags": [
      "programming"
    ],
    "title": "کارگاه پایتون"
  },
  "105": {
    "complexity": "مبتدی",
    "description": "",
    "id": 105,
    "language": "فارسی",
    "speakers": [
      13
    ],
    "tags": [
      "linux"
    ],
    "title": "کارگاه امنیت شبکه در لینوکس"
  },
  "106": {
    "description": "",
    "id": 106,
    "image": "/images/backgrounds/lunch.jpg",
    "title": "ناهار"
  },
  "107": {
    "complexity": "مبتدی",
    "description": "",
    "id": 107,
    "language": "فارسی",
    "speakers": [
      3
    ],
    "tags": [
      "cloud"
    ],
    "title": "کارگاه داکر"
  },
  "201": {
    "complexity": "مبتدی",
    "description": "در این ارائه، به لیبره آفیس به عنوان نرم‌افزاری جایگزین برای محیط اداری آفیس مایکروسافت پرداخته شده و نقش ویژه آن در محیط سیستم عامل لینوکس بیان می‌گردد و تاریخچه این نرم‌افزار از استار آفیس تا اپن آفیس و بعد از آن تأسیس بنیاد نرم‌افزار (Document Foundation) توسط فعالان نرم‌افزار آزاد و ایجاد لیبره‌آفیس بحث می‌شود. سپس به قابلیت‌ها و ویژگی‌های جدیدترین نسخه این نرم‌افزار پرداخته می‌شود، و نقاط قوت و ضعف آن در پردازش و نمایش متن فارسی مورد بحث قرار می‌گیرد.\n\nمهم‌ترین بخش این ارائه، پرداختن به نحوه مشارکت در توسعه و بهبود این نرم‌افزار است. مباحث مهم در پردازش و نمایش متن فارسی، چگونگی فعالیت در تیم فارسی سازی لیبره آفیس فارسی، نحوه ترجمه رشته‌های نرم‌افزار برای ارائه رابط کاربری فارسی، نحوه ارائه گزارش باگ، وصله و رفع مشکلات، نحوه ایجاد کردن محیط کدنویسی و توسعه لیبره‌آفیس بیان شده، و ابزارهای مهم پردازش زبان فارسی در این نرم‌افزار بحث خواهد شد.\n\nاین ارائه هم برای کاربران لیبره‌آفیس و هم برای برنامه‌نویسان و علاقه‌مندان به بهبود این نرم‌افزار مهم مفید است.",
    "id": 201,
    "language": "فارسی",
    "speakers": [
      25
    ],
    "tags": [
      "opensource"
    ],
    "title": "لیبره آفیس به زبان شما: جهانی‌سازی و بومی‌سازی"
  },
  "202": {
    "complexity": "مبتدی",
    "description": "",
    "id": 202,
    "language": "فارسی",
    "speakers": [
      19
    ],
    "tags": [
      "programming"
    ],
    "title": "Node.js  در 30 دقیقه"
  },
  "203": {
    "complexity": "مبتدی",
    "description": "توزیع گنو/لینوکس اوبونتو، از ابتدای پیدایش در سال ۲۰۰۴، همواره سفیر پیشتاز نرم‌افزار آزاد در حوزهٔ میزکار بوده و هست. در هفته‌های گذشته، بمب خبری مارک شاتلورث، بنیان‌گذار اوبونتو دربارهٔ تغییرات بنیادی در برنامه‌ها و اهداف این توزیع، واکنش‌های مثبت و منفی زیادی را در جامعهٔ نرم‌افزار آزاد برانگیخت. در ارائهٔ پیش رو، دانیال بهزادی، از اعضای رسمی جامعهٔ گنو/لینوکس اوبونتو، این تغییرات را بررسی کرده و جزئیات بیش‌تری را مطرح خواهد نمود.",
    "id": 203,
    "language": "فارسی",
    "speakers": [
      1
    ],
    "tags": [
      "linux"
    ],
    "title": "تحولات اوبونتو"
  },
  "204": {
    "complexity": "مبتدی",
    "description": "در این ارائه به معرفی استک Elastic شامل Elasticsearch به عنوان محل ذخیره داده و موتور جستجو (متنی)، Logstash و Beats برای جمع آوری و غنی سازی داده ها و Kibana به عنوان ابزاری برای ساخت داشبورد ها و مانیتور داده‌های موجود در Elasticsearch خواهیم پرداخت. در ابتدا به توضیح معماری و کاربردهای این استک می‌پردازیم. سپس مباحث مربوط به چگونگی ذخیره‌سازی داده‌ها بر روی Elasticsearch و نحوه‌ی کوئری‌ زدن بر روی آن معرفی خواهد شد. سپس قابلیت‌های پیشرفته تر این موتور جستجو برای تحلیل داده‌های متنی و غیرمتنی توضیح داده خواهد شد. پس از آن به معرفی   Logstash و Beats می‌پردازیم که وظیفه‌ی جمع‌آوری و غنی‌سازی داده‌ها را در این استک بر عهده دارند. مثالی از کاربرد این ابزارها در مانیتور کردن سرورها توضیح داده خواهد شد. در آخرین مرحله به معرفی   Kibana خواهیم پرداخت که ابزاری قدرتمند برای بصری سازی داده‌های ذخیره شده بر روی Elasticsearch است و نحوه‌ی ساختن داشبوردی برای مانیتور کردن بلادرنگ داده‌ها توضیح داده خواهد شد. در پایان به معرفی قابلیت‌های پلاگین Timelion در Kibana می‌پردازیم که ابزاری مفید برای بصری سازی و انجام تحلیل‌های ساده بر روی داده‌های سری زمانی است. در انتها نیز مواردی جهت افزایش کارایی و سرعت ذخیره‌سازی و سرچ بر روی داده‌ها توضیح داده خواهد شد. ",
    "id": 204,
    "language": "فارسی",
    "speakers": [
      18
    ],
    "tags": [
      "data"
    ],
    "title": " معرفی Elastic Stack"
  },
  "205": {
    "complexity": "مبتدی",
    "description": "",
    "id": 205,
    "language": "فارسی",
    "speakers": [
      19
    ],
    "tags": [
      "cloud",
      "opensource"
    ],
    "title": "همه آن چیزی که لازم است در باره ی CI/CD بدانید"
  },
  "206": {
    "complexity": "مبتدی",
    "description": "",
    "id": 206,
    "language": "فارسی",
    "speakers": [
      0
    ],
    "tags": [
      "iot"
    ],
    "title": "میان افزاری به نام i1820"
  },
  "207": {
    "complexity": "مبتدی",
    "description": "",
    "id": 207,
    "language": "فارسی",
    "speakers": [
      20
    ],
    "tags": [
      "iot"
    ],
    "title": "اینترنت اشیا در لینوکس"
  },
  "208": {
    "complexity": "مبتدی",
    "description": "با توجه به رشد کسب و کارهای آنلاین در ایران نیاز به یک سیستم توسعه پذیر به شدت حس می‌شود اما به دلیل عدم وجود زیرساخت‌های Cloud Computing عمومی در ایران مانند Google Cloud Platform و Amazon Web Services موانع زیادی برای پیاده‌سازی یک سیستم پایدار با تعداد کاربر بسیار بالا نیاز دارد. این ارائه سعی دارد که روشی را برای توسعه این گونه نرم‌افزارها در بستری که در حال حاضر در کشور موجود است توضیح دهد. در این ارائه تجربیاتی که در توسعه Quiz of Kings داشته‌ام را توضیح می‌دهم و راه‌حلی را که برای رسیدن به یک سیستم با میلیون‌ها کاربر به آن رسیدیم را بیان خواهم کرد.",
    "id": 208,
    "language": "فارسی",
    "speakers": [
      7
    ],
    "tags": [
      "cloud"
    ],
    "title": "بستر گسترش پذیر وب برروی لینوکس"
  },
  "209": {
    "complexity": "مبتدی",
    "description": "TensorFlow یک کتابخانه نرم افزاری متن باز برای پیاده سازی الگوریتم های هوش ماشینی است که توسط تیم Google Brain  برای مقاصد تخقیقاتی و تولید محصولات هوشمند، ساخته شده است. در این ارائه، برنامه ای برای پیش بینی قیمت ملک با این کتابخانه پیاده سازی خواهد شد/",
    "id": 209,
    "language": "فارسی",
    "speakers": [
      24
    ],
    "tags": [
      "opensource"
    ],
    "title": "هوش ماشین با Tensor Flow"
  },
  "210": {
    "complexity": "مبتدی",
    "description": "",
    "id": 210,
    "language": "فارسی",
    "speakers": [
      24
    ],
    "tags": [
      "opensource"
    ],
    "title": "آشنایی با Expo"
  },
  "211": {
    "complexity": "مبتدی",
    "description": "به نظر میرسد رویای علمی-تخلی حیات در دنیای مجازی به تحقق نزدیک شده است. در سال های اخیر جامعه جهانی محققان و همچنین فناوری های موجود در زمینه رباتیک و هوش مصنوعی به این بلوغ رسیده اند که بستر های شبیه سازی تمامی نیازهای دنیای واقعی را مرتفع میکند و چه بسا مزیت های بیشتری هم به این حوزه پیشکش میکند. از نشانه های حرکت به سمت دنیای شبیه سازی شده برگزاری اولین دوره مسابقات Space Robotics توسط NASA است که با هدف برنامه ریزی ربات انسان نمای ناسا (Valkyrie) برای انجام عملیات در ایستگاه فضایی بین‌المللی ISS طراحی شده است و اختصاص جایزه یک میلیون دلاری نشان از اهمیت بالای این حوزه دارد. این مسابقات اما به جای استفاده از ربات واقعی و در مکان واقعی در بسترشبیه سازی شده Gazebo و تحت رابط نرم افزاری ROS اجرا خواهد شد. از دیگر نشانه های این موضوع، مسابقات Swarmathon ناسا است که هدف آن تست و ارزیابی امکان استفاده از تعداد زیاد ربات ها در همکاری با یکدیگر برای انجام اهداف برنامه ریزی شده مشترک است. این مسابقات نیز به منظور کنار گذاشتن پیچیدگی های مکانیکی و کنترلی و تمرکز بر روی الگوریتم و هوش Agent ها در محیط شبیه سازی برگزار میشود. در این ارائه، بر آن شدیم تا آخرین فناوری های این حوزه اعم از محیط شبیه سازی، میان-افزار، سیستم عامل ربات ها و معماری استفاده شده را معرفی و همچنین نحوه راه اندازی یک سیستم شامل ایجاد یک دنیای مجازی، ساخت، تولید و کنترل ربات های شبیه سازی شده در این محیط  به همراه یک نسخه نمایشی از رفتار های پیاده سازی شده برای یک تیم امداد و نجات رباتی، اجمالا توضیح داده شود.",
    "id": 211,
    "language": "فارسی",
    "speakers": [
      6
    ],
    "tags": [
      "cloud"
    ],
    "title": "مسابقات NASA Swarmathon"
  },
  "212": {
    "complexity": "مبتدی",
    "description": "برنامه نویسی تابعی، همانند الگوهای برنامه نویسی شئ‌گرا و دستوری، یکی از الگوهای برنامه نویسی است.  در این الگو تلاش می‌شود نوشتن برنامه‌ها تحت تاثیر ساختار ماشین ون نیومن قرار نگیرد. بنابراین در یک زبان برنامه نویسی مبتنی بر الگوی تابعی، برنامه نویس به جای دیکته کردن نحوه‌ی انجام کار به ماشین، کاری که از آن انتظار دارد را مطرح می‌کند. در نتیجه، این امر، منجر به کاهش پیچیدگی ساختار برنامه‌ها و افزایش بهره‌وری در تولید نرم افزار می‌گردد. همانگونه که از نام این الگو پیداست، محاسبات در یک زبان مبتنی بر الگوی‌ تابعی به کمک محاسبه‌ی توابع انجام می‌پذیرد. از طرفی هیچ تابعی نمی‌بایست دارای اثر جانبی باشد. این بدان معناست که فراخوانی هر تابعی، منجر به تغییر وضعیت قسمتی دیگر از برنامه نمی‌شود. بنابراین فراخوانی یک تابع به ازای یک ورودی مشخص همیشه منجر به خروجی یکسانی می‌شود. زبان‌های چندالگویی زیادی از الگوی تابعی در کنار سایر الگوها، مانند الگوی شئ‌گرا، استفاده می‌کنند. در این میان می‌توان زبان‌های Python، C++، Java و Scala را نام برد. برای تابعی شمرده شدن یک زبان فاکتورهایی وجود دارد که زبان‌های چندالگویی جهت پشتیبانی از سایر الگوها، بخش محدودی از این فاکتورها را پشتیبانی کنند. از این رو در این ارائه برای توضیح الگوی تابعی از زبان Haskell به عنوان یک زبان تابعی صرف بهره گرفته می‌شود.",
    "id": 212,
    "language": "فارسی",
    "speakers": [
      10
    ],
    "tags": [
      "programming"
    ],
    "title": "Haskel، پیچیده یا ساده؟"
  },
  "300": {
    "description": "",
    "id": 134,
    "image": "/images/backgrounds/coffee-break.jpg",
    "title": "Coffee break"
  },
  "108": {
    "complexity": "پیشرفته",
    "description": "",
    "id": 108,
    "language": "فارسی",
    "speakers": [
      5
    ],
    "tags": [
      "programming"
    ],
    "title": "کارگاه ابزارهای علمی در پایتون"
  },
  "109": {
    "complexity": "مبتدی",
    "description": "در این کارگاه به مفاهیم پایه شبکه در سیستم عامل لینوکس پرداخته می شود:\n\n 1-آشنایی با tcp/ip \n\n 2- ابزارهای پایه شبکه \n\n 3- آشنایی با جدول IP \n\n 4- جدول IP پیشرفته ",
    "id": 109,
    "language": "فارسی",
    "speakers": [
      17
    ],
    "tags": [
      "linux"
    ],
    "title": "شبکه در لینوکس"
  },
  "110": {
    "complexity": "مبتدی",
    "description": "آپاچی کافکا یکی از معروف‌ترین بسترهای پردازش داده‌های جاری است که به عنوان قلب پایپ‌لاین‌های پردازش داده‌های جاری و بیگ‌دیتا مطرح است. در این کارگاه ابتدا با مبانی اصلی پایپ‌لاین‌های پردازش داده‌های جاری و نقش Message Broker ها در آن‌ها آشنا می‌شویم. سپس به چگونگی نصب و برخی تنظیمات اولیه یک کلاستر آپاچی کافکا پرداخته خواهد شد. در انتها هم با پیاده‌سازی یک Producer و یک Consumer به صورت عملی با نحوه‌ی تعامل با کافکا با استفاده‌ از Java API آن آشنا خواهیم شد. لازم است شرکت‌کنندگان از سابقه‌ی قبلی برنامه‌نویسی جاوا برخوردار باشند. سایر مفاهیم موردنیاز مرتبط با پردازش داده‌های جاری و بیگ‌دیتا در خلال کارگاه مطرح خواهد شد. همراه داشتن یک لپ‌تاپ با ابزارهای توسعه‌ی جاوا و قابلیت اتصال به اینترنت برای بخش عملی کارگاه الزامی است.",
    "id": 110,
    "language": "فارسی",
    "speakers": [
      15
    ],
    "tags": [
      "data"
    ],
    "title": " کارگاه پیاده سازی و اجرای Apache Kafka"
  },
  "111": {
    "complexity": "مبتدی",
    "description": "1-مقدمه ای بر رایانش ابری و مفاهیم مجازی سازی \n\n 2-معرفی راه حل های طراحی و پیاده¬سازی محیط¬های ابری \n\n3-معماری OpenStack \n\n4- بررسی اجزاء OpenStack \n\n5-پیاده¬سازی یک سناریو محیط ابری به وسیله OpenStack ",
    "id": 111,
    "language": "فارسی",
    "speakers": [
      2
    ],
    "tags": [
      "cloud"
    ],
    "title": "کارگاه OpenStack"
  },
  "112": {
    "complexity": "مبتدی",
    "description": "Node.js یک Runtimeبرای JavaScript است. که به خاطر مقیاس پذیری و سرعت بالا در سال های اخیر مورد استقبال بالای جامعه ی توسعه دهندگان متن باز و شرکت هایی نظیر Walmart ، LinkedIn، Microsoft و ... قرار گرفته است.\n\n معماری Event-driven  در Node  به گونه ای است که  با استفاده از آن می توانید به راحتی برنامه هایی نظیر چت یا سرور برای بازی Realtime را بسیار آسان تر و بهینه تر از تکنولوژی های دیگر بدون درد سر هایی مثل Race Condition و Dead Lock پیاده سازی کنید. هم چنین جامعه ی توسعه دهندگان Node.js به قدر پویا و بزرگ است که ظرف 4 سال گذشته بیش از 420 هزار  package درnpmبارگذاری شده است.به گونه ای که برای حل بسیاری از مسایل  از Crawle کردن Web گرفته تا مدیریت و فشرده سازی کد ها در آن package هایی وجود دارد.\n\nدر این ارایه سعی می شود که با معرفی مفاهیم و مختلف Node  و بررسی چند مثال کاربردی تصویری کلی  از Node به مخاطب ارایه شود.\n\n\n\nسر فصل ها:\n\nفلسفه ی Node.js\n\nورودی/خروجی ناهمگام و  نگرش Node  به برنامه نویس\n\nنصب و راه اندازی Node.j\n\nساختار Package ها\n\nاستفاده از NPM\n\nپیاده سازی یک سرور http  ساده با Express\n\nپیاده سازی یک برنامه ی Chat  ساده با Socket.io\n\nحل مساله ی Callback hell و Memory Leak\n\nبررسی ویژگی های ES6 و Node.js 7\n\nمقیاس پذیری در Node\n\nمعرفی MEAN Stack\n\nNode برای چه پروژه های مناسب است؟",
    "id": 112,
    "language": "فارسی",
    "speakers": [
      16
    ],
    "tags": [
      "programming"
    ],
    "title": "کارگاه NodeJS"
  },
  "301": {
    "complexity": "مبتدی",
    "description": "",
    "id": 301,
    "language": "فارسی",
    "speakers": [
      0
    ],
    "tags": [
      "programming"
    ],
    "title": "Golang : آینده C"
  },
  "302": {
    "complexity": "مبتدی",
    "description": "",
    "id": 302,
    "language": "فارسی",
    "speakers": [
      22
    ],
    "tags": [
      "opensource"
    ],
    "title": "خدمات متقابل اپن‌سورس، شرکت‌ها، و دانشجویان"
  },
  "303": {
    "complexity": "مبتدی",
    "description": "خودمونیما ولی خیلیامون وقتی می‌بینیم یه مبحثی توی کامپیوتر داغ شده تصمیم می‌گیریم ما هم از قافله عقب نمونیم و ازش استفاده کنیم. معماری میکروسرویس هم یکی از مباحث داغ امروز نرم‌افزاره که از قاعده مستثنا نیست. وقتی توی اینترنت جست‌وجو کنید، پره از بلاگ‌هایی در ستایش این رویکرد. پس بیاید یه دور مشکلاتی که قراره بهش بر بخوریم رو با هم مرور کنیم که اگه راست کار ما نیست بیخودی با micro-service دهن خود را service نکنیم!",
    "id": 303,
    "language": "فارسی",
    "speakers": [
      3
    ],
    "tags": [
      "cloud"
    ],
    "title": "د چگونه با microservice دهن خود را service کنیم"
  },
  "304": {
    "complexity": "مبتدی",
    "description": "",
    "id": 304,
    "language": "فارسی",
    "speakers": [
      21
    ],
    "tags": [
      "opensource"
    ],
    "title": "زنجیره سرویس در NFV"
  },
  "305": {
    "complexity": "مبتدی",
    "description": "",
    "id": 305,
    "language": "فارسی",
    "speakers": [
      11
    ],
    "tags": [
      "opensource"
    ],
    "title": "ذخیره سازهای نرم افزار بنیان"
  },
  "306": {
    "complexity": "مبتدی",
    "description": "",
    "id": 306,
    "language": "فارسی",
    "speakers": [
      26
    ],
    "tags": [
      "opensource"
    ],
    "title": "سیستم عامل های آزاد در تلفن همراه"
  },
  "307": {
    "complexity": "مبتدی",
    "description": "Android Things يک پلتفرم جديد است كه گوگل براى سوق دادن توسعه دهندگان به سمت اينترنت اشياء با استفاده از سرویس و API هایش ايجاد كرده است. Android Things در كنار تمامى سيستم عامل هاى پيشين گوگل مانند Android wear، Android Auto و Android TV قرار مى‌گيرد و هدفش اين است كه مدل‌هاى مختلفى از گجت‌ها را شامل شود.\n\nدر بررسى نسخه اوليهٔ Android Things، به اين موضوع پى مى‌بريم كه اين پلتفرم بر مبناى يكى ديگر از سيستم عامل‌هاى اندرويدى به نام پروژه Brillo كه سال گذشته عرضه شد، بنا شده است و از خدمات گوناگون شركت گوگل بهره مى‌برد.\n\nهم اكنون، گوگل در تلاش است تا توسط به‌روز‌رسانى‌هاى آينده خود در قالب پچ‌ها و رفع اشكالات نرم‌افزارى و به‌روزرسانى‌هاى خود توسعه دهندگان، زيرساخت‌هاى مورد نياز جهت پيشرفت اين پلتفرم را در اختيار توسعه دهندگان قرار دهد.\n\nدر كنار تمام اين موارد، اين موضوع را نيز مد نظر داشته باشيد كه توسعه دهندگان اين امتياز را هم دارند كه از سخت‌افزارهاى متنوعى مانند Raspberry Pi 3، Intel Edison و NXP Pico استفاده كنند تا محصولات مورد نظرشان را -آن هم در مقياس بزرگ- بسازند.",
    "id": 307,
    "language": "فارسی",
    "speakers": [
      27
    ],
    "tags": [
      "opensource"
    ],
    "title": "آشنایی با Android Things"
  },
  "308": {
    "complexity": "مبتدی",
    "description": "در این ارائه به بررسی مفاهیم و پلتفرم‌های  مرتبط با Big Data Streams که در سال‌های اخیر با نام جدید Fast Data مطرح شده می‌پردازیم.",
    "id": 308,
    "language": "فارسی",
    "speakers": [
      15
    ],
    "tags": [
      "data"
    ],
    "title": "From Big Data to Fast Data"
  },
  "309": {
    "complexity": "پیشرفته",
    "description": "",
    "id": 309,
    "language": "فارسی",
    "speakers": [
      23
    ],
    "tags": [
      "data"
    ],
    "title": "آشنایی با cassandra"
  },
  "310": {
    "complexity": "پیشرفته",
    "description": "Prepare to dive into the IoT and learn how open-source solutions help engineers overcome IoT challenges. You will also get the insider's information on the world-leading open-source IoT platform - Kaa - as you will be guided by key product specialists of the platform",
    "id": 310,
    "language": "Englsih",
    "speakers": [

    ],
    "tags": [
      "iot"
    ],
    "title": "آشنایی با Kaa"
  },
  "400": {
    "complexity": "مبتدی",
    "description": "کارگاه مقدماتی لینوکس اصلی ترین کارگاه جشنواره است. این کارگاه در محل سایت دانشکده مهندسی کامپیوتر و فناوری اطلاعات دانشگاه صنعتی امیرکبیر برگزار می گردد. در این کارگاه شرکت کنندگان با مفاهیم پایه لینوکس و نحوه استفاده از آن آشنا می شوند.\n\n اگر هنوز با این سیستم عامل متن باز آشنا نشده اید این کارگاه را از دست ندهید.\n\nدر پایان کارگاه به شرکت کنندگان گواهی دوره اعطا میشود.",
    "id": 400,
    "language": "فارسی",
    "speakers": [
    8
    ],
    "tags": [
      "linux"
    ],
    "title": "کارگاه مقدماتی لینوکس"
  },
  "500": {
    "complexity": "مبتدی",
    "description": "شرکت در این کارگاه به تمامی شرکت کنندگان در کارگاه مبتدی توصیه می شود.\n\n در این کارگاه شیوه نصب سیستم عامل اوبونتو به شرکت کنندگان آموزش داده می شود. \n\n پس اگر قصد شرکت در کارگاه مبتدی را دارید و سیستم عامل لینوکس برروی لپ تاپ خود نصب نکرده اید در این کارگاه شرکت کنید تا با هم به نصب سیستم عامل بپردازیم.",
    "id": 400,
    "language": "فارسی",
    "speakers": [
      8
    ],
    "tags": [
      "linux"
    ],
    "title": "کارگاه نصب سیستم عامل لینوکس"
  }
}
